let str ='[00:27.30]亿万光年外惊起一滴朝露\n' +
    '[00:31.44]似彗星稍纵即逝坠落尘土\n' +
    '[00:35.67]扬起方寸内狂澜沉沉浮浮\n' +
    '[00:39.33]一眼星穹深处有多少风波暗伏\n' +
    '[00:43.47]闲游时分闭目格局已在心腑\n' +
    '[00:47.67]谋算经纬几度错落一手满盘输\n' +
    '[00:52.08]悬夜袖轻拂挥散万里迷雾\n' +
    '[00:55.98]斩敌无数何如破敌不伤一子卒\n' +
    '[00:59.91]谁来马蹄卷尘土化风袭面吹拂\n' +
    '[01:03.78]敕令出云骑千万数听我吩咐\n' +
    '[01:07.95]谁敢阻九隅到天都看银河星罗棋布\n' +
    '[01:12.72]天绝处亦可再进一步\n' +
    '[01:34.11]亿万光年外惊起一滴朝露\n' +
    '[01:38.19]似彗星稍纵即逝坠落尘土\n' +
    '[01:42.45]扬起方寸内狂澜沉沉浮浮\n' +
    '[01:46.11]一眼星云深处有多少风波暗伏\n' +
    '[01:50.25]闲游时分闭目格局已在心腑\n' +
    '[01:54.42]谋算经纬几路错落一手满盘输\n' +
    '[01:58.86]天阙袖轻拂挥散万里迷雾\n' +
    '[02:02.76]斩敌无数何如破敌不伤一子卒\n' +
    '[02:06.66]谁可令无疆宇宙一夕对弈顿悟\n' +
    '[02:10.62]兵刃见止戈又何须穷兵黩武\n' +
    '[02:14.76]谁敢在先手执棋前叩关斩阵说赢输\n' +
    '[02:19.47]天绝处我亦再行一步\n' +
    '[02:22.89]千秋承平岁不必见史书\n' +
    '[02:31.68]浮舟远尘世外不知几朝暮\n' +
    '[02:40.59]太初那寰宇开之初\n' +
    '[02:44.49]谁授人无穷英明神武\n' +
    '[02:48.72]推手便几万年残局翻覆\n' +
    '[02:52.83]胜天地雷霆一怒\n' +
    '[02:56.64]谁能在掌中役物直待春秋亘古\n' +
    '[03:00.72]岁月远看往来纵横不绝于书\n' +
    '[03:04.89]天绝处有河海江湖银河间星罗棋布\n' +
    '[03:09.54]前无路今亦再行一步\n' + 
    '[03:09.54]';
let data = {
    name:'',
    song:'策神霄'
};